knaufinator/6DOF-Rotary-Stewart-Motion-Simulator/Controller/sdkconfig.defaults.esp32s3
# ESP32-S3 (PCBv2) Configuration Overrides
# New board with direct GPIO MCPWM step/dir + W5500 SPI Ethernet
#
# Build: idf.py set-target esp32s3 && idf.py build

# Target
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# Serial/Console — UART primary + USB Serial JTAG secondary
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_USB_CDC_SUPPORT_ETS_PRINTF=n

# Flash size (8MB on new board)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# Bluetooth — ESP32-S3 is BLE-only (no Classic BT)
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_NIMBLE_ENABLED=n

# RMT Configuration
CONFIG_RMT_ISR_IRAM_SAFE=y
CONFIG_RMT_ENABLE_DEBUG_LOG=n
